주어진 데이터에서 결측치가 80%이상 되는 컬럼은(변수는) 삭제하고, 80% 미만인 결측치가 있는 컬럼은 'city'별 중앙값으로 값을 대체하고 'f1'컬럼의 평균값을 출력

In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv('../../Datasat/bigdata_certification_kr/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [11]:
df.isnull().sum()

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [12]:
df.shape

(100, 8)

In [13]:
#EDA - 결측 비율 확인
df.isnull().sum()/df.shape[0]

id      0.00
age     0.00
city    0.00
f1      0.31
f2      0.00
f3      0.95
f4      0.00
f5      0.00
dtype: float64

In [14]:
#f3 컬럼 삭제
print("삭제 전: ", df.shape)
df = df.drop(['f3'], axis=1)
print("삭제 후: ", df.shape)

삭제 전:  (100, 8)
삭제 후:  (100, 7)

In [17]:
#도시 확인
df['city'].unique()

array(['서울', '부산', '대구', '경기'], dtype=object)

In [18]:
s = df[df['city']=='서울']['f1'].median()
b = df[df['city']=='부산']['f1'].median()
d = df[df['city']=='대구']['f1'].median()
k = df[df['city']=='경기']['f1'].median()
s,b,d,k

(68.0, 62.0, 75.0, 58.0)

In [19]:
#대체 전 샘플 데이터 출력
df[18:21]

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울   NaN   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산   NaN   1  ISFP  29.269869

In [20]:
#f1결측치 city 별 중앙값으로 대체
df['f1'] = df['f1'].fillna(df['city'].map({'서울':s, '부산':b, '대구':d, '경기':k}))

In [21]:
df[18:21]

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울  68.0   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산  62.0   1  ISFP  29.269869

In [22]:
print(df['f1'].mean())

65.52